-- phpMyAdmin SQL Dump
-- version 4.7.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jun 13, 2018 at 08:13 PM
-- Server version: 10.1.25-MariaDB
-- PHP Version: 5.6.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `rice_area`
--

-- --------------------------------------------------------

--
-- Table structure for table `analy`
--

CREATE TABLE `analy` (
  `id_ana` int(10) NOT NULL,
  `id_user` int(10) NOT NULL,
  `id_rice` int(10) NOT NULL,
  `id_soil` int(10) NOT NULL,
  `id_fer` int(10) NOT NULL,
  `id_weed` int(10) NOT NULL,
  `day` date NOT NULL,
  `num_farms` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `locations` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `care` varchar(255) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `comment`
--

CREATE TABLE `comment` (
  `id_comment` int(10) NOT NULL,
  `id_user` int(10) NOT NULL,
  `comment` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `like_comment` int(10) NOT NULL,
  `unlike_comment` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `fertilizer`
--

CREATE TABLE `fertilizer` (
  `id_fer` int(10) NOT NULL,
  `name_fer` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `type_fer` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `detail_fer` varchar(10000) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `fertilizer`
--

INSERT INTO `fertilizer` (`id_fer`, `name_fer`, `type_fer`, `detail_fer`) VALUES
(61001, 'นางฟ้าทรงฉัตรสูตร 16-16-8', '1', 'ปุ๋ยสำหรับนาข้าว 5 นางฟ้าทรงฉัตรสูตร 16-16-8 ราคาหน้าโรงงาน แนะนำให้ใช้กับนาข้าวที่เป็นดินทรายหรือดินร่วนปนทราย หรือในดินที่มีธาตุโพแทสเซียมต่ำไม่เพียงพอต่อความต้องการของพืช เหมาะสำหรับพืชทุกชนิด เช่น ยางพาราเล็กแถบภูเขาอายุไม่เกิน 2-5 ปี และพืชไร่โดยเฉพา'),
(61002, 'ห้านางฟ้าทรงฉัตสูตร 16-20-0', '1', 'ปุ๋ยสำหรับนาข้าว เหมาะสำหรับพืชทุกชนิด โดยเฉพาะข้าวนาดินเหนียว ทำให้ข้าวเจริญเติบโตดีลำต้นแกร่ง กอใหญ่ แข็งแรง ต้านทานโรคและแมลงได้ดี เมล็ดข้าวมีน้ำหนัก รวงใหญ่ ไม่มีเมล็ดลีบ ผลผลิตต่อไร่สูง ปุ๋ยเคมีตราห้านางฟ้าทรงฉัตร สูตร 16-20-0 มีธาตุอาหารหลักไนโตรเจน'),
(61003, 'ห้านางฟ้าทรงฉัตรสูตร 16-8-8', '1', 'ปุ๋ยเคมีสำหรับยางเล็กและนาข้าวสูตร 16-8-8 ราคาส่ง แนะนำให้ใช้กับนาข้าวที่เป็นดินทรายหรือดินร่วนปนทราย หรือในดินที่มีธาตุโพแทสเซียมต่ำไม่เพียงพอต่อความต้องการของพืช เหมาะสำหรับพืชทุกชนิด โดยเฉพาะข้าวนาดินทราย ทำให้ข้าวเจริญเติบโตดี ลำต้นแกร่ง กอใหญ่ แข็งแร'),
(61004, 'แกรนนูลาร์หมีคู่สูตร 46-0-0', '3', 'คุณสมบัติ เป็นปุ๋ยเคมีชนิดเม็ด ประกอบด้วยปริมาณธาตุอาหารรับรอง ดังนี้\r\nไนโตรเจนทั้งหมด (N) 46%\r\nฟอสเฟตที่เป็นประโยชน์ (P2O5) 0%\r\nโพแทชที่ละลายน้ำ (K2O) 0%\r\nปริมาณสารเป็นพิษ	ไบยูเร็ต (Biuret)	1%\r\nพืชที่แนะนำให้ใช้ พืชผัก และใช้เป็นปุ๋ยเคมีแต่งหน้าสำหรับนาข'),
(61005, 'แกรนนูลาร์หมีคู่สูตร 16- 8- 8', '1', 'คุณสมบัติ เป็นปุ๋ยเคมีชนิดเม็ด ประกอบด้วยปริมาณธาตุอาหารรับรอง ดังนี้\r\nไนโตรเจนทั้งหมด (N) (ไนโตรเจนอยู่ในรูปแอมโมเนียม หรือยูเรีย)	16%\r\nฟอสเฟตที่เป็นประโยชน์ (P2O5) 16%\r\nโพแทชที่ละลายน้ำ (K2O) 8%\r\nพืชที่แนะนำให้ใช้ ข้าว ข้าวโพด ข้าวฟ่าง มันสำปะหลัง ไม้ผล และพืชผัก ที่เป็นดินทราย หรือดินร่วนปนทราย\r\nอัตราที่ใช้ วิธีใช้ และระยะเวลาที่ใช้\r\nก. สำหรับแปลงกล้า ใช้ปุ๋ยเคมีอัตรา 20 กิโลกรัมต่อไร่ แล้วคลุกปุ๋ยเคมีกับเทือกก่อนหว่านเมล็ดข้าว หรืออาจจะใส่หลังจากตกกล้า 10 วัน\r\n\r\nข. สำหรับนาดำ\r\n1. การใส่ปุ๋ยเคมีครั้งแรก\r\n1.1 สำหรับข้าวพันธุ์ไม่ไวต่อช่วงแสง ซึ่งปลูกได้ทั้งนาปี และนาปรัง ใช้ปุ๋ยเคมีอัตรา 50 กิโลกรัมต่อไร่ ก่อนปักดำ 1 วัน แล้วคราดกลบ\r\n1.2 สำหรับพันธุ์ข้าวไวต่อช่วงแสง ซึ่งปลูกได้เฉพาะนาปีเท่านั้น ใช้ปุ๋ยเคมีอัตรา 40 กิโลกรัมต่อไร่ ก่อนปักดำ 1 วัน แล้วคราดกลบ\r\n\r\nค. สำหรับนาหว่านน้ำตม หรือนาหยอด\r\n สำหรับข้าวพันธุ์ไม่ไวต่อช่วงแสง ใส่ปุ๋ยเคมีอัตรา 25-30 กิโลกรัมต่อไร่       หลังข้าวงอกแล้ว 20-30 วัน\r\n1.2 สำหรับพันธุ์ข้าวไวต่อช่วงแสง ใช้ปุ๋ยเคมีอัตรา 20 กิโลกรัมต่อไร่ หลังจากข้าวงอกแล้ว 20-30 วัน\r\n\r\n'),
(61008, 'แกรนนูลาร์หมีคู่สูตร 16-16-8', '1', 'คุณสมบัติ เป็นปุ๋ยเคมีชนิดเม็ด ประกอบด้วยปริมาณธาตุอาหารรับรอง ดังนี้\r\nไนโตรเจนทั้งหมด (N) (ไนโตรเจนอยู่ในรูปแอมโมเนียม หรือยูเรีย)	16%\r\nฟอสเฟตที่เป็นประโยชน์ (P2O5) 16%\r\nโพแทชที่ละลายน้ำ (K2O) 8%\r\nพืชที่แนะนำให้ใช้ ข้าว ข้าวโพด ข้าวฟ่าง มันสำปะหลัง ไม้ผล และพืชผัก ที่เป็นดินทราย หรือดินร่วนปนทราย\r\nอัตราที่ใช้ วิธีใช้ และระยะเวลาที่ใช้\r\nข้าว\r\n\r\nก. สำหรับแปลงกล้า ใช้ปุ๋ยเคมีอัตรา 20 กิโลกรัมต่อไร่ แล้วคลุกปุ๋ยเคมีกับเทือกก่อนหว่านเมล็ดข้าว       หรืออาจจะใส่หลังจากตกกล้า 10 วัน\r\n\r\nข. สำหรับนาดำ\r\n1. การใส่ปุ๋ยเคมีครั้งแรก\r\n1.1 สำหรับข้าวพันธุ์ไม่ไวต่อช่วงแสง ซึ่งปลูกได้ทั้งนาปี และนาปรัง ใช้ปุ๋ยเคมีอัตรา 25-30 กิโลกรัมต่อไร่ ก่อนปักดำ 1 วัน แล้วคราดกลบ\r\n1.2 สำหรับพันธุ์ข้าวไวต่อช่วงแสง ซึ่งปลูกได้เฉพาะนาปีเท่านั้น ใช้ปุ๋ยเคมีอัตรา  20-25 กิโลกรัมต่อไร่ ก่อนปักดำ 1 วัน แล้วคราดกลบ\r\n\r\nค. สำหรับนาหว่านน้ำตม หรือนาหยอด\r\n1. การใส่ปุ๋ยเคมีครั้งแรก\r\n1.1 สำหรับข้าวพันธุ์ไม่ไวต่อช่วงแสง ใส่ปุ๋ยเคมีอัตรา 25-30 กิโลกรัมต่อไร่       หลังข้าวงอกแล้ว 20-30 วัน\r\n1.2 สำหรับพันธุ์ข้าวไวต่อช่วงแสง ใช้ปุ๋ยเคมีอัตรา 20 กิโลกรัมต่อไร่ หลังจากข้าวงอกแล้ว 20-30 วัน'),
(61009, 'ปุ๋ยตรากระต่ายสูตร 16-20-0', '1', 'ธาตุอาหาร\r\nไนโตรเจน (N) : 16%\r\nฟอสฟอรัสที่เป็นประโยชน์ (P2O5) : 20%\r\nโพแทสเซียมที่ละลายน้ำ (K2O) : 0%\r\nความชื้นโดยน้ำหนัก : 0.78%\r\n\r\nปริมาณธาตุอาหารรอง \r\nแคลเซียม (CaO) : 2%\r\nกำมะถัน (S) : 14%\r\n\r\nพืชแนะนำ\r\nนิยมใช้ในนาข้าว ข้าวโพด และพืชไร่ บำรุงราก และช่วยการแตกกอ\r\n'),
(61010, 'ปุ๋ยตรากระต่าย สูตร 16-16-8', '1', 'ธาตุอาหาร\r\nไนโตรเจน (N) : 16%\r\nฟอสฟอรัสที่เป็นประโยชน์ (P2O5) : 16%\r\nโพแทสเซียมที่ละลายน้ำ (K2O) : 8%\r\nความชื้นโดยน้ำหนัก : 0.82%\r\n\r\nพืชแนะนำ\r\nนิยมใช้ในนาข้าว (นาดินทราย) และพืชไร่ทุกชนิด เช่น ข้าวโพด มันสำปะหลัง และอ้อย โดยช่วยสร้างระบบราก และการแตกกอ\r\n\r\nแหล่งที่นิยมใช้\r\nทั่วทุกภาคของประเทศไทย\r\n\r\nลักษณะทางกายภาพอื่นๆ\r\nเม็ดสีเทา ใช้กับเครื่องหว่าน หรือเครื่องพ่นปุ๋ยได้ดี \r\nในพืชไร่ใช้เป็นปุ๋ยรองพื้นก่อนเพาะปลูก');

-- --------------------------------------------------------

--
-- Table structure for table `rice`
--

CREATE TABLE `rice` (
  `id_rice` int(10) NOT NULL,
  `name_rice` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `type_rice` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `detail_rice` varchar(3000) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf16 COLLATE=utf16_unicode_ci;

--
-- Dumping data for table `rice`
--

INSERT INTO `rice` (`id_rice`, `name_rice`, `type_rice`, `detail_rice`) VALUES
(61001, 'ข้าวไรซ์เบอร์รี่ (Riceberry)', 'ข้าวเพื่อสุขภาพ', '           ข้าวไรซ์เบอร์รี่  ได้จากการผสมข้ามพันธุ์ระหว่างข้าวเจ้าหอมนิลกับข้าวขาวดอกมะลิ 105 ลักษณะเป็นข้าวเจ้า สีม่วงเข้ม รูปร่างเมล็ดเรียวยาว ข้าวกล้องมีความนุ่มนวลมาก ปลูกได้ตลอดทั้งปี ให้ผลผลิตต่อไร่ปานกลาง ต้านทานต่อโรคไหม้ แต่ไม่ต้านทานโรคหลาว จึงควรเปลี่ยนเมล็ดพันธุ์ทุกรอบการปลูก\r\n           อีกข้อจำกัดคือเป็นข้าวที่ต้องการเอาใจใส่เป็นพิเศษ โดยปลูกแบบเกษตรอินทรีย์ และต้องมีสภาพอากาศเย็น เพื่อสร้างสีเมล็ดลักษณะประจำพันธุ์ข้าวไรซ์เบอร์รี่ ความสูง 105-110 เซนติ เมตร อายุเก็บเกี่ยว 130 วัน ผลผลิต 300-500 กิโลกรัมต่อไร่ เปอร์เซ็นต์ข้าวกล้อง (brown rice) 76% ต้นข้าวหรือข้าวเต็มเมล็ด (head rice) 50% ความยาวของเมล็ดข้าวเปลือก 11 มิลลิเมตร ข้าวกล้อง 7.5 มิลลิเมตร ข้าวขัด 7.0 มิลลิเมตร\r\n'),
(61002, 'ข้าวมันปู ', 'ข้าวเพื่อสุขภาพ', '              ข้าวมันปู เป็นข้าวพันธุ์หนึ่งที่มีเยื่อหุ้มเปลือกข้าวเป็นสีแดงแบบสีมันปู จัดเป็นข้าวกล้องหรือข้าวซ้อมมือชนิดหนึ่ง มีไขมันในปริมาณเดียวกับข้าวกล้อง ซึ่งสูงกว่าข้าวขัดสี ประมาณเท่าหนึ่ง มีสารที่เรียกว่าเคโรทีนที่จะเปลี่ยนเป็นวิตามินเอในร่างกายสูงกว่าข้าวขัดสี ชาวจีนเรียก ข้าวแดง หรือชื่อพื้นเมือง อั้งคั่ก นอกจากเป็นข้าวยังผลิตออกมาในรูป ยีสต์สีแดงใช้ประกอบอาหารและเป็นสมุนไพรรักษาโรค บ้านเรานำข้าวแดงเมืองจีนหรืออั้งคั่กมาเป็นสีผสมอาหารเพื่อให้สีแดง เช่น เต้าหู้ยี้ หมูแดง เนื้อแดง                 '),
(61003, 'ข้าวหอมนิล', 'ข้าวเพื่อสุขภาพ', '          ข้าวสีนิล เกษตรกรปลูกกันน้อย เพราะไม่ได้เป็นข้าวเศรษฐกิจ ดูแลยาก เลยทำให้มีราคาแพงกว่าข้าวประเภทอื่นเล็กน้อย แต่ถ้าเป็นข้าวกล้องงอกสีนิลจะแพงขึ้นอีก 2-3 เท่าตัว เคล็ดลับการกินข้าว ไม่ว่าคุณจะกินข้าวแบบไหนก็ตาม ถ้าเลือกซื้อข้าวที่เพิ่งเกี่ยวไปฤดูเกี่ยวล่าสุด และเพิ่งสีมาไม่นาน จะได้กินข้าวที่นุ่ม อร่อยกว่าข้าวค้างปี และสีทิ้งไว้นาน\r\n1. วิตามิน B1 ป้องกันเหน็บชา และช่วยการทำงานของระบบประสาท\r\n2. วิตามิน B2 ป้องกันโรคปากนกกระจอก และ ช่วยเผาผลาญอาหาร\r\n3. วิตามินบีรวม ช่วยป้องกันและบรรเทาอาการอ่อนเพลีย แขน ขาไม่มีแรง ปวดกล้ามเนื้อโรคผิวหนังบางชนิดบำรุงสมอง ทำให้เจริญอาหาร\r\n4. ไนอาซีน ช่วยการทำงานของระบบประสาท และระบบผิวหนัง\r\n5. แร่ธาตุเหล็ก แม็กนีเซียม ฟอสฟอรัส แคลเซียม ช่วยเสริมสร้างกระดูกและฟัน ป้องกันโรคโลหิตจาง ป้องกันไม่ให้เป็นตะคริว\r\n6. เส้นใย ช่วยให้ขับถ่ายสะดวก ป้องกันมะเร็งลำไส้ ซับไขมัน ช่วยลดระดับคลอเรสเตอรอลป้องกันโรคไขมัน สะสมในเส้นเลือด\r\n7. คาร์โบไฮเดรต ให้พลังงานต่อร่างกาย\r\n8. โปรตีน เสริมสร้าง ซ่อมแซมส่วนที่สึกหรอ\r\n'),
(61004, 'ข้าวหอมมะลิแดง', 'ข้าวเพื่อสุขภาพ', '          ข้าวหอมมะลิแดงมีเมล็ดข้าวเรียวยาวเยื่อหุ้มเมล็ดสีน้ำตาลแดงเข้ม เมื่อหุงแล้วได้เนื้อข้าวร่วน ให้รสสัมผัสคล้ายข้าวหอมมะลิที่มีความเคี้ยวมันและทรงคุณค่า โดยบริษัท เดอะสุขขะเฮ้าส์ (ไทยแลนด์) ได้ส่งเสริมให้เกษตรกรปลูกในระบบอินทรีย์และทำสัญญาซื้อขายข้าวแบบ Fair trade กับเกษตรกรในแถบภาคเหนือตอนบนได้แก่จังหวัด เชียงใหม่ เชียงราย พะเยา ลำปาง และอุตรดิตถ์ ประโยชน์ของ ข้าวกล้องหอมมะลิแดง'),
(61005, 'ข้าวกล้อง', 'ข้าวเพื่อสุขภาพ', '         ข้าวมีสีน้ำตาลอ่อน เป็นข้าวที่สีเอาเปลือกออกโดยที่ยังมีจมูกข้าวและเยื่อหุ้มเมล็ดข้าวอยู่ ซึ่งมีคุณค่าอาหารที่มีประโยชน์มาก เนื่องจากข้าวกล้องมีใยอาหารเหลืออยู่มากกว่าข้าวขัดสี 3 เท่า การกินข้าวกล้องทุกวันจะช่วยทำให้ระบบขับถ่ายดีขึ้น \r\n        ข้าวกล้องงอก (Germinated brown rice หรือ GABA-rice) เป็นข้าวกล้องที่ต้องนำมาผ่านกระบวนการงอกเสียก่อน โดยการนำข้าวกล้องมาแช่น้ำจนมีรากงอกออกมา กลายเป็นข้าวกล้องงอก ซึ่งจะทำให้ข้าวกล้องมีสารอาหารเพิ่มขึ้น โดยเฉพาะสารกาบา และข้าวกล้องที่แช่น้ำทิ้งไว้แล้วเมื่อนำไปหุงก็จะได้ข้าวที่นุ่มน่ารับประทานกว่าข้าวกล้องธรรมดาด้วย'),
(61006, 'ข้าวเหลืองประทิว', 'ข้าวขาว', '            ข้าวเหลืองปะทิว เป็นข้าวพันธุ์พื้นเมืองของภาคใต้ ยังมีอีกชนิดหนึ่งที่ฟังชื่อแล้วก็เรียกความสนใจได้ดีทีเดียว อย่าง “ข้าวเหลืองปะทิว” ซึ่งถือเป็นข้าวพันธุ์พื้นเมืองของอำเภอปะทิว จังหวัดชุมพร มีอายุมานานกว่าสองร้อยปีแล้ว \r\n\r\n           คุณลักษณะพิเศษที่โดดเด่นของข้าวเหลืองปะทิว คือ เป็นข้าวเจ้าที่ไวต่อช่วงแสง ปลูกได้ปีละ 1 ครั้ง ลำต้นและใบสีเขียว สูงประมาณ 150 เซนติเมตร ใบกว้างและยาว คอรวงยาว ข้าวเปลือกสีเหลือง เมล็ดยาวเรียว และจะออกดอกระหว่างวันที่ 25-30 พ.ย.ของทุกปีและธันวาคมเป็นช่วงเก็บเกี่ยว'),
(61007, 'ข้าวเหลืองอ่อน', 'ข้าวขาว', '            ข้าวเหลืองอ่อน คือข้าวพันธุ์พื้นเมืองของจังหวัดพิจิตร ปลูกในฤดูนาปี  มีอะมีโลสอยู่ระดับปานกลางประมาณ 20 – 22  เมล็ดข้าวมีขนาดปานกลาง  ข้าวสุกจะมีลักษณะค่อนข้างนุ่ม เมื่อหุงข้าวสุกทิ้งไว้นานๆ ข้าวก็ยังคงไม่แข็งตัว  เหมาะสำหรับผู้บริโภคที่นิยมข้าวที่ไม่แข็ง หุงตอนเช้า สามารถเก็บไว้ทานตอนเย็นได้'),
(61008, 'เหนียวกอเดียว', 'ข้าวขาว', '            เหนียวกอเดียว เป็นข้าวพันธุ์พื้นเมืองที่มีลักษณะพิเศษดีเด่น คือ ทรงกอตั้งตรง แตกกอดี อายุเบา รูปร่างเมล็ดเรียวยาว ข้าวสารสวย ขาวนวล คุณภาพข้าวสุกเหนียวนุ่ม และมีกลิ่นหอมเหมือนพันธุ์กข6 แต่นำไปขัดสีได้ข้าวเต็มเมล็ดและต้นข้าวมากกว่า จำหน่ายได้ในราคาระดับเดียวกันหรือสูงกว่าข้าวพันธุ์กข6 เป็นที่ต้องการของตลาดท้องถิ่นและมีตลาดรับซื้อที่แน่นอน แต่มีข้อควรระวังคือ ไม่มีความต้านทานต่อโรคไหม้'),
(61009, 'ข้าวเสาไห้', 'ข้าวขาว', 'ลักษณะพิเศษ\r\n         ข้าวเสาไห้นั้นจะมีลักษณะที่โดดเด่น คือ เมล็ดสวย เรียวยาว ถ้าเป็นข้าวเกี่ยวจะเป็นข้าวเคี่ยว คือ หุงขึ้นหม้อ ถ้าเป็นข้าวใหม่เมื่อหุงแล้วจะนุ่มหอมมีลักษณะคล้ายกับข้าวหอมมะลิทั่วไป แหล่งที่พบ บ้านเสาไห้ ตำบลเสาไห้ อำเภอเสาไห้ จังหวัดสระบุรี ความสัมพันธ์กับชุมชน\r\n         ข้าวเสาไห้เป็นข้าวที่มีคุณภาพและเป็นสัญลักษณ์ของชาวบ้านเสาไห้ จึงสร้างชื่อเสียงให้กับชาวสระบุรีได้มาก และสามารถสร้างอาชีพให้กับเกษตรกร ชาวสระบุรีซึ่งเป็นรายได้หลักสำหรับเลี้ยงครอบครัว\r\nความสำคัญทางเศรษฐกิจ\r\n'),
(61010, 'ข้าว เหนียวดำ ใบดำ ', 'ข้าวเหนียว', 'ชนิดข้าว ข้าวเหนียว นาปี \r\nลักษณะพันธุ์ ทรงกอตั้ง ลำต้นสีม่วง แผ่นใบสีม่วง สีปล้องเส้นม่วง ต้นสูง 130 เซนติเมตร ต้นแข็งปานกลาง รวงยาวประมาณ 26 เซนติเมตร การติดเมล็ดปานปลาง คอรวงยาว เมล็ดข้าวเปลือกสีม่วง-ดำ ข้าวกล้องสีม่วงดำ เมล็ดค่อนข้างป้อม คุณภาพการหุงต้มข้าวสุก นุ่ม เหนียว มีกลิ่นหอม เก็บเกี่ยวกลางเดือนพฤศจิกายน\r\n'),
(61011, 'พันธุ์กข10', 'ข้าวเหนียว', 'ชนิดข้าวเหนียว\r\n\r\nลักษณะประจำพันธุ์เป็นข้าวเหนียว สูงประมาณ 115 เซนติเมตรไม่ไวต่อช่วงแสงอายุเก็บเกี่ยวประมาณ 130 วันทรงกอตั้งตรง ลำต้นสีเขียวเข้ม ใบค่อนข้างกว้าง รวงอยู่ใต้ใบธงระยะพักตัวของเมล็ดประมาณ 5 สัปดาห์เมล็ดข้าวเปลือกสีฟางเมล็ดข้าวกล้อง กว้าง x ยาว x หนา = 2.3 x 7.6 x 1.8 มิลลิเมตรคุณภาพข้าวสุก เหนียวนุ่ม'),
(61012, 'พันธุ์กข4', 'ข้าวเหนียว', 'ชนิด ข้าวเหนียว\r\nคู่ผสมเหลืองทองนาปรัง / ไออาร์8//ดับเบิ้ลยู1252 /// กข2\r\nประวัติพันธุ์ได้จากการผสมพันธุ์ระหว่างพันธุ์พี่น้องของ กข1 (เหลืองทองนาปรัง / ไออาร์8 สายพันธุ์ 17-1) กับพันธุ์ ดับเบิ้ลยู1252 (หรือ อีเค1252) จากอินเดีย ซึ่งต้านทานแมลงบั่ว แล้วนำลูกผสมชั่วแรกผสมกับพันธุ์ กข2 เพื่อให้ได้ลักษณะข้าวเหนียว และคัดเลือกตามสถานีทดลองข้าวต่างๆ จนได้สายพันธุ์ BKN6805-22-13\r\n\r\nลักษณะประจำพันธุ์เป็นข้าวเหนียว สูงประมาณ 115 เซนติเมตรไม่ไวต่อช่วงแสงลำต้น กาบใบ และขอบใบสีม่วง เมล็ดยาวเรียวข้าวเปลือกสีน้ำตาลเข้มอายุเก็บเกี่ยวประมาณ 127 วันระยะพักตัวของเมล็ดประมาณ 4 สัปดาห์เมล็ดข้าวกล้อง กว้าง x ยาว x หนา = 2.4 x 7.3 x 1.8 มิลลิเมตรคุณภาพข้าวสุก แข็ง'),
(61013, 'พันธุ์ กข2', 'ข้าวเหนียว', 'ลักษณะประจำพันธุ์เป็นข้าวเหนียว สูงประมาณ 115 เซนติเมตรไม่ไวต่อช่วงแสงใบสีเขียว กาบใบสีเขียวอ่อนเมล็ดข้าวเปลือกสีฟางอ่อนอายุเก็บเกี่ยวประมาณ 130 วันระยะพักตัวของเมล็ดประมาณ 4 สัปดาห์เมล็ดข้าวกล้อง กว้าง x ยาว x หนา = 2.6 x 7.2 x 1.9 มิลลิเมตร'),
(61014, 'พันธุ์เหนียวอุบล 2', 'ข้าวเหนียว', 'ลักษณะประจำพันธุ์เป็นพันธุ์ข้าวเหนียว สูงประมาณ 118 เซนติเมตรไวต่อช่วงแสงอายุเก็บเกี่ยว ประมาณ 15 พฤศจิกายนทรงกอแผ่ ต้นแข็ง ใบสีเขียวเข้ม กาบใบสี เขียว ใบธงตั้งตรง รวงแน่นปานกลาง คอรวงสั้นเมล็ดข้าวเปลือกสีน้ำตาลระยะพักตัวของเมล็ดประมาณ 3 สัปดาห์เมล็ดข้าวกล้อง กว้าง x ยาว x หนา = 2.2 x 7.2 x 1.8 มิลลิเมตร'),
(61015, 'พันธุ์เหนียวอุบล 1 ', 'ข้าวเหนียว', 'ลักษณะประจำพันธุ์ เป็นข้าวเหนียว สูงประมาณ 145 เซนติเมตรไวต่อช่วงแสงอายุเก็บเกี่ยว ประมาณกลางเดือนพฤศจิกายนทรงกอตั้งตรง แตกกอดี ต้นและใบสีเขียวเข้ม ใบธงตั้ง เมล็ดยาวเรียวข้าวเปลือกสีฟางระยะพักตัวของเมล็ดประมาณ 7 สัปดาห์เมล็ดข้าวกล้อง ยาว 7.52 มิลลิเมตร กว้าง x ยาว x หนา = 2014 x 7.52 x1.78 มิลลิเมตรคุณภาพข้าวสุก เหนียวนุ่ม'),
(61016, 'พันธุ์เหนียวสันป่าตอง ', 'ข้าวเหนียว', 'ลักษณะประจำพันธุ์เป็นข้าวเหนียว สูงประมาณ 150 เซนติเมตรไวต่อช่วงแสงทรงกอแฝเล็กน้อย ต้นค่อนข้างแข็ง รวงยาว เมล็ดยาวเรียวเมล็ดข้าวกล้อง กว้าง x ยาว x หนา = 2.1 x 7.2 x 1.3 มิลลิเมตรข้าวเปลือกสีน้ำตาลอายุเก็บเกี่ยวประมาณ 26 พฤศจิกายนระยะพักตัวของเมล็ด ประมาณ 6 สัปดาห์คุณภาพข้าวสุก เหนียวนุ่ม'),
(61017, 'พันธุ์เหมยนอง 62 เอ็ม ', 'ข้าวเหนียว', 'ลักษณะประจำพันธุ์เป็นข้าวเหนียว สูงประมาณ 150 เซนติเมตรไวต่อช่วงแสงลำต้นและขอบใบสีม่วง แต่เมื่อแก่จะเปลี่ยนเป็นสีเขียว กอค่อนข้างแผ่ เมล็ดสั้นป้อมข้าวเปลือกสีฟางกระน้ำตาล ก้นจุดอายุเก็บเกี่ยว ประมาณ 20 พฤศจิกายนระยะพักตัวของเมล็ด ประมาณ 1 สัปดาห์เมล็ดข้าวกล้อง กว้าง x ยาว x หนา = 2.9 x 6.6 x 2.0 มิลลิเมตร'),
(61018, 'พันธุ์หางยี 71 ', 'ข้าวเหนียว', 'ลักษณะประจำพันธุ์เป็นข้าวเหนียว สูงประมาณ 152 เซนติเมตรไวต่อช่วงแสง ปลูกได้เฉพาะฤดูนาปีลำต้นสีเขียว ใบแคบ และยาว สีเขียวเข้ม รวงอ่อนมีระแง้แผ่ออกคล้ายตีนนกเมล็ดข้าวยาวเรียวข้าวเปลือกสีน้ำตาลอายุเก็บเกี่ยว ประมาณ 4 พฤศจิกายนระยะพักตัวของเมล็ด ประมาณ 1 สัปดาห์เมล็ดข้าวกล้อง กว้าง x ยาว x หนา = 2.1 x 7.1 x 1.8 มิลลิเมตรคุณภาพข้าวสุก เหนียวนุ่ม'),
(61019, 'พันธุ์กำผาย 15 ', 'ข้าวเหนียว', 'ลักษณะประจำพันธุ์เป็นข้าวเหนียวต้นสูง สูงประมาณ 168 เซนติเมตรไวต่อช่วงแสงอายุเก็บเกี่ยว ประมาณ 30 พฤศจิกายนระยะพักตัวของเมล็ด ประมาณ 6 สัปดาห์เมล็ดข้าวกล้อง กว้าง x ยาว x หนา = 2.8 x 7.2 x 2.0 มิลลิเมตร'),
(61020, 'พันธุ์กข8', 'ข้าวเหนียว', 'ลักษณะประจำพันธุ์เป็นข้าวเหนียว สูงประมาณ 150 เซนติเมตรไวต่อช่วงแสงอายุเก็บเกี่ยวประมาณ 23 พฤศจิกายนลำต้นและใบสีเขียวเข้ม ใบธงตั้ง ฟางแข็ง ชูรวงอยู่เหนือใบ เมล็ดข้าวค่อนข้างป้อม ลำต้นแข็งเมล็ดข้าวเปลือกสีเหลืองระยะพักตัวของเมล็ดประมาณ 3 สัปดาห์'),
(61021, 'พันธุ์กข6', 'ข้าวเหนียว', 'ลักษณะประจำพันธุ์เป็นข้าวเหนียว สูงประมาณ 154 เซนติเมตรไวต่อช่วงแสงทรงกอกระจายเล็กน้อย ใบยาวสีเขียวเข้ม ใบธงตั้ง เมล็ดยาวเรียวเมล็ดข้าวเปลือกสีน้ำตาลอายุเก็บเกี่ยวประมาณ 21 พฤศจิกายนระยะพักตัวของเมล็ดประมาณ 5 สัปดาห์'),
(61022, 'ข้าวหอมมะลิ 80 ', 'ข้าวหอมมะลิ', 'ลักษณะประจำพันธุ์\r\n- ทนน้ำท่วมแบบฉับพลันในทุกระยะการเจริญเติบโต\r\n- ข้าวเจ้าหอม ความสูงประมาณ        155 เซนติเมตร\r\n- พันธุ์ข้าวไวต่อช่วงแสง ปลูกได้เฉพาะนาปี\r\n- ลำต้นสีเขียวจาง ใบสีเขียวยาวค่อนข้างแคบ ฟางอ่อน\r\n- ใบธงทำมุมกับคอรวง เมล็ดข้าวรูปร่างเรียวยาว\r\n- อายุเก็บเกี่ยว ประมาณช่วงวันที่   26 - 30 พฤศจิกายน ของทุกปี\r\n- จำนวนรวงต่อกอประมาณ    10 – 12 รวง (นาดำ)          \r\n- เมล็ดข้าวกล้อง กว้าง x ยาว x หนา = 2.1 x 7.2 x 1.7 มิลลิเมตร\r\n- การเกิดท้องไข่ประมาณ            0.8\r\n- ข้าวเปลือกสีฟางคล้ายพันธุ์ขาวดอกมะลิ 105\r\n'),
(61023, 'เหลืองเลาขวัญ ', 'ข้าวหอมมะลิ', 'ลักษณะพันธุ์ ต้นสูง 135 เซนติเมตร ลำต้นค่อนข้างแข็ง ใบใหญ่ยาว คลุมวัชพืชได้ดี แผ่นใบสีเขียว ใบมีขนเล็กน้อย รวงยาวประมาณ 28 เซนติเมตร คอรวงยาว ระแง้ถี่ การติดเมล็ดปานกลาง ข้าวเปลือกสีน้ำตาล ข้าวกล้องสีขาว เรียว ท้องไข่น้อย คุณภาพการหุงต้ม ข้าวสุก ร่วน มีกลิ่นหอมเล็กน้อย ทนแล้งได้ดี เก็บเกี่ยวกลางเดือนธันวาคม'),
(61024, 'ประดู่แดง', 'ข้าวหอมมะลิ', 'ลักษณะพันธุ์ ทรงกอแผ่ ต้นสูงประมาณ 130 เซนติเมตร ใบสีเขียว แผ่นใบมีขนบ้าง แตกกอดี ลำต้นแข็งปานกลาง ปล้องสีเหลืองอ่อน ออกรวงประมาณต้นพฤศจิกายน รวงยาวประมาณ 28 เซนติเมตร คอรวงยาว ระแง้ถี่ การติดเมล็ดปานกลาง ข้าวเปลือกสีน้ำตาลแดง ข้าวกล้องสีขาว รูปร่างเมล็ดข้าวกล้องเรียว คุณภาพการหุงต้มข้าวสุกนุ่ม และมีกลิ่นหอมเล็กน้อย'),
(61025, 'โสมาลี', 'ข้าวหอมมะลิ', 'ลักษณะพันธุ์ การแตกกอดี ทรงกอแผ่ ต้นสูงประมาณ 135 เซนติเมตร ลำต้นสีเขียว ใบสีเขียว แผ่นใบมีขนเล็กน้อย ปล้องสีเหลืองอ่อน รวงยาวประมาณ 28 เซนติเมตร ระแง้ถี่ การติดเมล็ดแน่น คอรวงยาว ข้าวเปลือกสีฟาง เมล็ดเรียวยาว ข้าวกล้องสีขาว ใส มีเลื่อมมัน จมูกเล็ก การเก็บเกี่ยวปลายเดือนพฤศจิกายน ลำต้นอ่อน ล้มง่าย เมล็ดร่วงง่าย คุณภาพหุงต้ม ข้าวสุกเหนียวนุ่ม และมีกลิ่นหอม'),
(61026, 'พวงเงิน', 'ข้าวหอมมะลิ', 'ลักษณะพันธุ์ ทรงกอตั้ง ลำต้นสีเขียวใบใหญ่ และยาวสีเขียว แผ่นใบมีขน ต้นสูง 155 เซนติเมตร ลำต้นค่อนข้างแข็ง ปล้องสีเหลืองอ่อน รวงยาวประมาณ 30 เซนติเมตร ระแง้ถี่ การติดเมล็ดดี คอรวงยาว เมล็ดร่วงง่าย ข้าวเปลือกสีฟาง เมล็ดยาว ข้าวกล้องสีขาว คุณภาพการหุงต้มนุ่ม มีกลิ่นหอมเล็กน้อย เก็บเกี่ยวปลายเดือนพฤศจิกายน'),
(61027, 'ขาวตาเคลือบ', 'ข้าวหอมมะลิ', 'ลักษณะพันธุ์ ทรงกอตั้ง แตกกอดี ความสูงประมาณ 130 เซนติเมตร ลำต้นสีเขียว ใบสีเขียว แผ่นใบมีขน ลำต้นแข็งปานกลาง ข้อต่อใบสีเขียว ปล้องสีเขียว รวงยาวประมาณ 26 เซนติเมตร การติดเมล็ดปานกลาง คอรวงสั้น เมล็ดข้าวเปลือกสีฟาง ข้าวกล้องสีขาว เมล็ดเรียว เป็นท้องไข่น้อย คุณภาพข้าวสุก นุ่ม ร่วน มีกลิ่นหอมเล็กน้อย เก็บเกี่ยวต้นเดือนธันวาคม'),
(61028, 'ปทุมเทพ', 'ข้าวหอมมะลิ', 'ลักษณะพันธุ์ เป็นข้าวเจ้าหอม ปลูกได้ทั้งนาปีและนาปรัง อายุการเก็บเกี่ยว 110-125 วัน ทรงกอตั้ง แตกกอดีมาก ใบสีเขียว มีขน ใบธงยาว รวงอยู่ใต้ใบ เมล็ดข้าวเปลือกสีฟาง มีหางสั้นบางเมล็ด ผลผลิต 800-900 กิโลกรัมต่อไร่ คุณภาพเมล็ดคล้ายข้าวขาวมะลิ 105 คุณภาพการหุงต้มข้าวสุก นุ่ม ค่อนข้างเหนียว มีกลิ่นหอม อ่อน ต้านทานโรคไหม้ และ โรคขอบใบแห้ง'),
(61029, 'นางมลหอม', 'ข้าวหอมมะลิ', 'ลักษณะพันธุ์ ทรงกอตั้ง ต้นสูงประมาณ 130 เซนติเมตร ลำต้นสีเขียว แผ่นใบสีเขียว ใบมีขนบ้าง ปล้องสีเหลือง ลำต้นค่อนข้างแข็ง คอรวงยาว ระแง้ถี่ การติดเมล็ดดี รวงยาวประมาณ 28 เซนติเมตร เมล็ดข้าวเปลือกสีฟาง ข้าวกล้องสีขาว เรียว ท้องไข่น้อย คุณภาพการหุงต้ม ข้าวสุก ร่วน มีกลิ่นหอม เก็บเกี่ยวกลางเดือนธันวาคม'),
(61030, 'มะลิดำ', 'ข้าวหอมมะลิ', 'ลักษณะพันธุ์ ต้นสูง 125 ซม. แผ่นใบใหญ่ ใบยาวสีเขียวคลุมวัชพืชได้ดี เมล็ดข้าวเปลือกสีฟาง ข้าวกล้องสีดำรูปร่างเรียว ยาว การหุงต้ม นุ่ม เหนียว กลิ่นหอมอ่อน สรรพคุณทางยา มีธาตุเหล็กสูง ข้าวกล้องสีดำ ใช้ประโยชน์จากสีดำทำสีผสมอาหารได้ เก็บเกี่ยวปลายเดือนพฤศจิกายน'),
(61031, 'มะลิแดง ', 'ข้าวหอมมะลิ', 'ลักษณะพันธุ์ ต้นสูงประมาณ 125 ซม. ใบสีเขียว แตกกอดี รวงยาว คอรวงยาว ติดเมล็ดดี เมล็ดข้าวเปลือกสีฟาง ข้าวกล้องสีแดง คุณภาพการขัดสีดี คุณภาพการหุงต้ม นุ่ม มีกลิ่นหอม ต้านทานโรคและแมลง เหมาะสมกับการผลิตแบบอินทรีย์ เก็บเกี่ยวปลายเดือนพฤศจิกายน');

-- --------------------------------------------------------

--
-- Table structure for table `soil`
--

CREATE TABLE `soil` (
  `id_soil` int(10) NOT NULL,
  `type_soil` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `detail_soil` varchar(3000) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf16 COLLATE=utf16_unicode_ci;

--
-- Dumping data for table `soil`
--

INSERT INTO `soil` (`id_soil`, `type_soil`, `detail_soil`) VALUES
(61001, 'ดินเหนียว', 'เป็นดินที่มีเนื้อละเอียด ในสภาพดินแห้งจะแตกออกเป็นก้อนแข็งมาก เมื่อเปียกน้ำแล้วจะมีความยืดหยุ่น สามารถปั้นเป็นก้อนหรือคลึงเป็นเส้นยาวได้ เหนียวเหนอะหนะติดมือ เป็นดินที่มีการระบายน้ำและอากาศไม่ดี แต่สามารถอุ้มน้ำ ดูดยึด และแลกเปลี่ยนธาตุอาหารพืชได้ดี เหมาะ'),
(61002, 'ดินร่วน', 'เป็นดินที่เนื้อดินค่อนข้างละเอียดนุ่มมือในสภาพดินแห้งจะจับกันเป็นก้อนแข็งพอประมาณ ในสภาพดินชื้นจะยืดหยุ่นได้บ้าง เมื่อสัมผัสหรือคลึงดินจะรู้สึกนุ่มมือแต่อาจจะรู้สึกสากมืออยู่บ้างเล็กน้อย เมื่อกำดินให้แน่นในฝ่ามือแล้วคลายมือออก ดินจะจับกันเป็นก้อนไม่แตกออก'),
(61003, 'ดินทราย', 'เป็นดินที่มีอนุภาคขนาดทรายเป็นองค์ประกอบอยู่มากกว่าร้อยละ 85 เนื้อดินมีการเกาะตัวกันหลวมๆ มองเห็นเป็นเม็ดเดี่ยวๆ ได้ ถ้าสัมผัสดินที่อยู่ในสภาพแห้งจะรู้สึกสากมือ เมื่อลองกำดินที่แห้งนี้ไว้ในอุ้งมือแล้วคลายมือออกดินก็จะแตกออกจากกันได้ แต่ถ้ากำดินที่อยู่ในสภ'),
(61004, 'ดินอื่น ๆ', 'ดินดี ในทางการเกษตรหมายถึง ดินที่มีความเหมาะสมต่อการปลูกพืช ปริมาณอนินทรียวัตถุ อินทรียวัตถุ น้ำ และอากาศ ในสัดส่วนที่เหมาะสม สามารถปลูกพืชได้โดยใช้วิธีการจัดการดูแลตามปกติธรรมดาที่ไม่ยุ่งยาก มักจะมีหน้าดินสีดำหนา มีปริมาณอินทรียวัตถุสูง มีธาตุอาหารที่เป็'),
(61005, 'ดินอื่น ๆ', ' ดินไม่ดี หรือ ดินเลว คือ ดินที่มีสมบัติทางกายภาพและเคมีไม่เหมาะสม หรือเหมาะสมน้อยสำหรับการเพาะปลูก ส่งผลให้พืชไม่สามารถเจริญเติบโตและให้ผลผลิตตามปกติได ้\r\nถ้าหากว่าจำเป็นต้องใช้ดินเหล่านี้ในการเพาะปลูกพืช ก็ต้องมีการจัดการแก้ไขให้เหมาะสมเสียก่อน'),
(61006, 'ดินอื่น ๆ', 'ดินชั้นบน เป็นดินที่มีความอุดมสมบูรณ์  มีแร่ธาตุหลายชิดและมีซากพืชซากสัตว์เน่าเปื่อย  (ฮิวมัส) ที่พืชต้องการทับถมกันอยู่มาก  ลักษณะของเนื้อดินเป็นสีดำคล้ำเม็ดดินหยาบ  หรือเม็ดดินมีขนาดใหญ่ร่วนซุย เป็นดินที่เหมาะต่อการเจริญเติบโตของพืช'),
(61007, 'ดินอื่น ๆ', 'ดินชั้นล่าง  อยู่ถัดจากดินชั้นบนลงไป มีความอุดมสมบูรณ์น้อยมาก เนื้อดินแน่น  เม็ดละเอียด     สีจาง  เป็นดินที่ไม่เหมาะต่อการเจริญเติบโตของพืช\r\n'),
(61008, 'ดินอื่น ๆ', ' ดินทรายร่วน (loamy sand) เป็นดินที่ประกอบไปด้วยปริมาณ ทราย 70 - 90เปอร์เซ็นต์ และปริมาณทรายแป้ง 0 – 30 เปอร์เซ็นต์และปริมาณ ดินเหนียว 0 – 15 เปอร์เซ็นต์ '),
(61009, 'ดินอื่น ๆ', ' ดินร่วนปนทราย (sandy loam) คือดินที่มีเปอร์เซ็นต์ดินเหนียวน้อยกว่า 20 เปอร์เซ็นต์และเปอร์เซ็นต์ทรายแป้งบวกกับสองเท่าของเปอร์เซ็นต์ดินเหนียวมากกว่า 30 เปอร์เซ็นต์ และทรายมากกว่า 52 เปอร์เซ็นต์ และอีกประเภทหนึ่ง คือ ดินที่มีดินเหนียวน้อยกว่า 7 เปอร์เซ็นต์ '),
(61010, 'ดินอื่น ๆ', ' ดินร่วนปนตะกอน (silt loam) เป็นดินที่ประกอบไปด้วย ทรายแป้งมากกว่า 50 เปอร์เซ็นต์ ดินเหนียว 12 – 27 เปอร์เซ็นต์ หรือดินที่มีทรายแป้ง 50 – 80 เปอร์เซ็นต์ และดินเหนียวน้อยกว่า 12 เปอร์เซ็นต์'),
(61011, 'ดินอื่น ๆ', 'ดินตะกอน (silt) เป็นดินที่ประกอบขึ้นจากทรายแป้งมากกว่า 90 เปอร์เซ็นต์ และมีดินเหนียวน้อยกว่า 12 เปอร์เซ็นต์'),
(61012, 'ดินอื่น ๆ', ' ดินร่วนเหนียวปนทราย (sandy clay loam) คือดินที่มีดินเหนียว 20 – 23 เปอร์เซ็นต์และทรายมากกว่า 45 เปอร์เซ็นต์'),
(61013, 'ดินอื่น ๆ', 'ดินร่วนเหนียว (clay loam) เป็นดินที่ประกอบไปด้วยดินเหนียว 27 – 40 เปอร์เซ็นต์ และทราย 20 – 45 เปอร์เซ็นต์'),
(61014, 'ดินอื่น ๆ', 'ดินร่วนเหนียวปนตะกอน (silty clay loam) เป็นดินที่ประกอบไปด้วย ดินเหนียว 27 – 40 เปอร์เซ็นต์และ ทรายน้อยกว่า 20 เปอร์เซ็นต์'),
(61015, 'ดินอื่น ๆ', 'ดินเหนียวปนทราย (sandy clay) เป็นดินที่ประกอบด้วย ดินเหนียวมากกว่า 35เปอร์เซ็นต์ และทรายมากกว่า 45 เปอร์เซ็นต์'),
(61016, 'ดินอื่น ๆ', 'ดินเหนียวปนตะกอน (silty clay) เป็นดินที่ประกอบด้วย ดินเหนียวมากกว่า 40เปอร์เซ็นต์ และ ทรายแป้งมากกว่า 40 เปอร์เซ็นต์ ');

-- --------------------------------------------------------

--
-- Table structure for table `user`
--

CREATE TABLE `user` (
  `id_user` int(10) NOT NULL,
  `id_userdata` int(10) NOT NULL,
  `username` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `status` enum('admin','user') COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `user`
--

INSERT INTO `user` (`id_user`, `id_userdata`, `username`, `password`, `status`) VALUES
(180001, 18001, 'admin', '21232f297a57a5a743894a0e4a801fc3', 'admin');

-- --------------------------------------------------------

--
-- Table structure for table `user_data`
--

CREATE TABLE `user_data` (
  `id_userdata` int(10) NOT NULL,
  `name_user` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `email_user` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `sex_user` enum('ชาย','หญิง') COLLATE utf8_unicode_ci NOT NULL,
  `fist_name` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `last_name` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `career` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `picture` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `permission` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `user_data`
--

INSERT INTO `user_data` (`id_userdata`, `name_user`, `email_user`, `password`, `sex_user`, `fist_name`, `last_name`, `career`, `picture`, `permission`) VALUES
(18001, 'admin', 'chaiyaporn.sri@northbkk.ac.th', '', 'ชาย', 'ชัยพร', 'ศรีวิตานนท์', 'ผู้ดูแลระบบ', '-', 1),
(18002, 'chaiyaporn01', 'joza5944@gmail.com', 'pass1234', 'ชาย', 'chaiyaporn', 'srivitanon', 'นักเรียน', '', 2);

-- --------------------------------------------------------

--
-- Table structure for table `weed`
--

CREATE TABLE `weed` (
  `id_weed` int(10) NOT NULL,
  `name_weed` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `type_weed` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `detail_weed` varchar(255) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `weed`
--

INSERT INTO `weed` (`id_weed`, `name_weed`, `type_weed`, `detail_weed`) VALUES
(61001, 'เพลี้ยไฟ (rice thrips)', 'แมลง', 'เพลี้ยไฟ Stenchaetohrips biformis (Bagnall) เป็นแมลงจำพวกปากดูด ขนาดเล็กลำตัวยาวประมาณ 1-2 มิลลิเมตร มีทั้งชนิดมีปีกและไม่มีปีก ตัวเต็มวัยมีสีดำ ตัวอ่อนสีเหลืองอ่อน ตัวเต็มวัยวางไข่ในเนื้อเยื่อของใบข้าว ตัวอ่อน มี 2 ระยะ ระยะเวลาตั้งแต่ตัวอ่อนถึงตัวเต็มวั'),
(61002, 'มวนง่าม (Stink bug)', 'แมลง', 'มวนง่าม Tetroda denticulifera (Berg) มีวงจรชีวิตมี 3 ระยะ คือ ระยะไข่ ระยะตัวอ่อน และระยะตัวเต็มวัย ระยะไข่เฉลี่ย 6-8 วัน ระยะก่อนวางไข่เฉลี่ย 35-43 วัน วางไข่เฉลี่ย 8-11 ครั้ง เพศเมียวางไข่เป็นแถวตามแนวใบข้าวเฉลี่ย 150-200 ฟอง ต่อตัว ฟักเป็นตัวอ่อนเฉลี่ย'),
(61003, 'หนอนแมลงวันเจาะยอดข้าว (rice whorl maggot)', 'แมลง', '  หนอนแมลงวันเจาะยอดข้าว Hydrellia spp. ตัวเต็มวัยเป็นแมลงวันชนิดหนึ่งลำตัวยาวประมาณ 2 มิลลิเมตร มีสีเทาอ่อน เพศเมียวางไข่เป็นฟองเดี่ยวๆ บนใบข้าว เฉลี่ย 100 ฟอง ในข่วงเวลา 3-7 วัน  ไข่มีลักษณะเรียว ยาว สีขาว ระยะไข่นาน 2-6 วัน ตัวหนอนหลังฟักจากไข่ใหม่ๆ มี'),
(61004, 'หนอนกระทู้กล้า', 'แมลง', 'ลักษณะการทำลายและการระบาด \r\n\r\n        โดยทั่วไปหนอนจะทำลายข้าวในเวลากลางคืนหนอนระยะแรกจะกัดกินผิวข้าวเมื่อโตขึ้นจะกัดกินกัดกินทั้งใบ และต้นข้าวเหลือไว้แต่ก้านใบตัวหนอนจะกัดกินต้นกล้าระดับพื้นดินนาข้าวจะถูกทำลายแหว่งเป็นหย่อมๆและอาจเสียหายได้ภายใน 1-2 วัน '),
(61005, 'เพลี้ยกระโดดหลังขาว (whitebacked planthopper , WBP', 'แมลง', ' ลักษณะการทำลาย\r\n\r\n          เพลี้ยกระโดดหลังขาวตัวเต็มวัยเข้ามาในแปลงข้าวช่วง 30 วันแรกหลังจากเป็นต้นกล้า โดยจะอาศัยอยู่บริเวณโคนต้นข้าว ใน 1 ฤดูปลูกสามารถเจริญเติบโตขยายพันธุ์ได้น้อยชั่วอายุกว่าเพลี้ยกระโดดสี น้ำตาล และชอบดูดกินน้ำเลี้ยงบนข้าวต้นอ่อน แล'),
(61006, 'แมลงสิง (rice bug, stink bug)', 'แมลง', 'ลักษณะการทำลายและการระบาด\r\n       ตัวอ่อนและตัวเต็มวัยใช้ปากแทงดูดกินน้ำเลี้ยงจากเมล็ดข้าว ระยะเป็นน้ำนม แต่ก็สามารถดูดกินเมล็ดข้าวทั้งเมล็ดอ่อนและเมล็ดแข็งโดยตัวเต็มวัยจะทำความเสียหายมากกว่า เพราะดูดกินเป็นเวลานานกว่าทำให้เมล็ดลีบ หรือเมล็ดไม่สมบูรณ์และผ'),
(61007, 'นกกระติ๊ดขี้หมู (spoted munia)', 'สัตว์', 'ความสำคัญและลักษณะการทำลาย\r\n        พบทั่วประเทศ เป็นศัตรูสำคัญของข้าว ลงกินข้าวพร้อมกันเป็นฝูงตั้งแต่ระยะข้าวเป็นน้ำนม ไปจนถึงเก็บเกี่ยว โดยเจาะขบเปลือกกินเฉพาะน้ำนมหรือเมล็ดข้าวอ่อน ขณะเดียวกันทำให้คอรวงข้าวหักง่าย นกชนิดนี้นิยมใช้ปล่อยในงานบุญ จึงมีปริ'),
(61008, 'ปูนา (rice field crab)', 'สัตว์', 'ความสำคัญและลักษณะการทำลาย\r\n        เป็นปูน้ำจืด ทั่วประเทศพบ 10 ชนิด เป็นศัตรูสำคัญในนาข้าว กัดทำลายข้าวในระยะต้นกล้า โดยกัดกินเฉพาะส่วนที่อ่อนและอวบน้ำ ได้ตลอดทั้งวัน ยกเว้นช่วงมีแดดจัด\r\n\r\nพืชอาหาร\r\n       ข้าว ซากพืชและซากสัตว์ในน้ำ\r\n\r\nการป้องกันและกำจ'),
(61009, 'หนูท้องขาว (roof rat, ship rat)', 'สัตว์', 'ความสำคัญและลักษณะการทำลาย\r\n        เป็นศัตรูของพืชเศรษฐกิจ และยังเป็นพาหะหรือรังโรคติดต่อสู่คนและสัตว์เลี้ยง เช่น กาฬโรค สครับทัยฟัส มิวรีนไทฟัส ฯลฯ กัดแทะทำลายข้าวและพืชไร่ตั้งแต่ระยะปลูก ไปจนถึงระยะเก็บเกี่ยว สำหรับไม้ยืนต้นอื่น ๆ จะกัดแทะเปลือกลำต้นหร'),
(61010, 'หนูนาใหญ่ (ricefield rat)', 'สัตว์', 'ความสำคัญและลักษณะการทำลาย\r\nลักษณะการทำลายข้าวระยะแตกกอ และฝักกระเจี๊ยบ เป็นศัตรูของข้าวและพืชไร่อื่น ๆ ที่ปลูกหลังนาแถบภาคกลาง ภาคตะวันออกเฉียงเหนือและภาคใต้ และยังเป็นพาหะหรือรังโรคติดต่อสำคัญสู่คนและสัตว์เลี้ยง เช่น กาฬโรค เลปโตสไปโรซีส สครับไทฟัส ฯลฯ '),
(61011, 'หนูพุกใหญ่ (great bandicoot)', 'สัตว์', 'ความสำคัญและลักษณะการทำลาย\r\n เป็นศัตรูพืชเศษฐกิจ และเป็นพาหะหรือนำโรคติดต่อสู่คนและสัตว์เลี้ยง เช่น ฮันต้าไวรัส มิวรีนไทฟัส เลปโตสไปโรซีส เป็นต้น ทำลายข้าวและพืชไร่ตั้งแต่ระยะปลูกจนถึงระยะเก็บเกี่ยว ส่วนพืชยืนต้นพบการทำลายเฉพาะในสวนปลูกใหม่ ส่วนยอดหรือโคน'),
(61012, 'หนูพุกเล็ก (lesser bandicoot)', 'สัตว์', 'ความสำคัญและลักษณะการทำลาย\r\n        พบมากทางภาคเหนือตอนบนและตอนล่าง ภาคตะวันออกเฉียงเหนือ เป็นศัตรูพืชเศรษฐกิจและเป็นพาหะหรือนำโรคติดต่อสู่คนและสัตว์เลี้ยงเช่นเดียวกันกับหนูพุกใหญ่ กัดแทะทำลายข้าวและพืชไร่ตั้งแต่ระยะปลูก ไปจนถึงระยะเก็บเกี่ยว\r\n\r\nพืชอาหาร\r'),
(61013, 'หอยเชอรี่ (golden apple snail)', 'สัตว์', 'ลักษณะการทำลาย \r\n      หอยเชอรี่เป็นศัตรูสำคัญของข้าวในระยะหลังหว่าน ชอบกัดกินต้นข้าวอ่อนๆระยะกล้าจนถึงแตกกอในช่วงเช้าและเย็นโดยจะกัดกินลำต้นข้าวใต้ผิวน้ำสูงเหนือระดับโคนต้น 0.5-1 นิ้ว (ภาพที่ 3)และกินส่วนใบที่ลอยน้ำต่อไปจนหมดต้น พบระบาดมากในนาข้าวทั่วประ'),
(61014, 'ข้าววัชพืช', 'วัชพืช', 'ข้าววัชพืช คือ ข้าวที่ชาวนาใช้ปลูกทั่วไป  มีชื่อวิทยาศาสตร์ว่า Oryza  sativa L. ใช้ปลูกในประเทศไทยมากกว่า 100 พันธุ์  เรียกในที่นี้ว่าข้าวปลูก  เป็นพันธุ์ข้าวที่ถูกคัดเลือกให้มีลักษณะที่ต้องการเช่นผลผลิตสูง  ข้าวสารมีสีขาว ใส คุณภาพหุงต้มนุ่มและหอม  ไปจนถ'),
(61015, 'ผักแว่น', 'กรุณาเลือก', 'ลักษณะทางชีววิทยา	\r\n   ลำต้นทอดเลื้อยไปตามพื้น ใบมีสี่แฉกโดยมีก้านใบชูขึ้น ไม่มีดอกไม่มีเมล็ดขยายพันธุ์ด้วยไหล และสปอร์  โดยสปอร์เป็นจุดสีดำอยู่ด้านหลังใบ  ขึ้นในที่ชื้น มีน้ำขัง  และทางน้ำหากดินแฉะรากจะหยั่งดินตื้นๆ หากมีน้ำขังจะลอยน้ำ  ระบาดรุนแรงจะทำให'),
(61016, 'หญ้าแดง', 'กรุณาเลือก', 'ลักษณะทางชีววิทยา	ลำต้นเรียวยาว  ข้อล่างๆจะติดกับพื้นดินและชูยอดขึ้น  ช่อดอกอยู่ติดกันแน่นจนดูเสมือนเป็นช่อดอกเดี่ยว  ชอบขึ้นในสภาพดินมีความชื้น  ไม่สามารถงอกใต้น้ำได้  มักงอกพร้อมหรือหลังข้าว 1-2 สัปดาห์ พบมากในนาหว่านข้าวแห้งและนาหว่านน้ำตม\r\n\r\nการป้องกั'),
(61017, 'หญ้าดอกขาว', 'วัชพืช', 'ลักษณะทางชีววิทยา	ลำต้นตรงหรือโน้ม ความสูง 12-120 ซ.ม.  ใบเรียบและปรกแหลมและเรียวยาว  กาบใบเรียบ มีเยื่อกันน้ำฝนเป็นแผ่นบาง ออกดอกได้ตลอดปี  ชอบขึ้นในสภาพดินแห้งถึงชื้น ไม่ชอบขึ้นในสภาพดินแฉะและไม่สามารถงอกใต้น้ำได้  หากงอกแล้วจะสามารถเจริญเติบโตได้ดีในสภ'),
(61018, 'กกขนาก', 'วัชพืช', 'ลักษณะทางชีววิทยา	\r\n    ลำต้นมีลักษณะเป็นสามเหลี่ยมไม่มีข้อปล้อง  ใบไม่แยกเป็นก้านใบและแผ่นใบ  ก้านชูดอกสูง 30-40 ซ.ม.  ดอกเป็นดอกช่อ  ลักษณะแน่นกลม  คล้ายร่มที่ซ้อนกัน ออกดอกตลอดปี    เมื่ออายุ  \r\n2-3 เดือน  ขยายพันธุ์ด้วยเมล็ด  ชอบขึ้นในที่ชื้นแต่ไม่งอก'),
(61019, 'กกทราย', 'วัชพืช', 'ลักษณะทางชีววิทยา	\r\n    ลำต้นมีลักษณะเป็นสามเหลี่ยมไม่มีข้อปล้อง ใบไม่แยกเป็นก้านใบและแผ่นใบ  ก้านชูดอกสูง 20-60 ซ.ม.  ช่อดอกแตกแขนงจากจุดเดียวกัน 3-8 แขนง  ดอกย่อยอัดกันแน่นบนก้านช่อดอกย่อยเป็น 2 แถว  ประกอบด้วยดอกจำนวน 6-24 ดอก ออกดอกตลอดปีเมื่ออายุ  2-');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `analy`
--
ALTER TABLE `analy`
  ADD PRIMARY KEY (`id_ana`);

--
-- Indexes for table `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`id_comment`);

--
-- Indexes for table `fertilizer`
--
ALTER TABLE `fertilizer`
  ADD PRIMARY KEY (`id_fer`);

--
-- Indexes for table `rice`
--
ALTER TABLE `rice`
  ADD PRIMARY KEY (`id_rice`);

--
-- Indexes for table `soil`
--
ALTER TABLE `soil`
  ADD PRIMARY KEY (`id_soil`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id_user`);

--
-- Indexes for table `user_data`
--
ALTER TABLE `user_data`
  ADD PRIMARY KEY (`id_userdata`);

--
-- Indexes for table `weed`
--
ALTER TABLE `weed`
  ADD PRIMARY KEY (`id_weed`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `analy`
--
ALTER TABLE `analy`
  MODIFY `id_ana` int(10) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `comment`
--
ALTER TABLE `comment`
  MODIFY `id_comment` int(10) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `fertilizer`
--
ALTER TABLE `fertilizer`
  MODIFY `id_fer` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61011;
--
-- AUTO_INCREMENT for table `rice`
--
ALTER TABLE `rice`
  MODIFY `id_rice` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61032;
--
-- AUTO_INCREMENT for table `soil`
--
ALTER TABLE `soil`
  MODIFY `id_soil` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61017;
--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
  MODIFY `id_user` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=180002;
--
-- AUTO_INCREMENT for table `user_data`
--
ALTER TABLE `user_data`
  MODIFY `id_userdata` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18003;
--
-- AUTO_INCREMENT for table `weed`
--
ALTER TABLE `weed`
  MODIFY `id_weed` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61020;COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
